bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/Peripherals/psram_ctrl_reg.h
/* 0x4 : psram_manual_control */
#define PSRAM_CTRL_PSRAM_MANUAL_CONTROL_OFFSET                  (0x4)
#define PSRAM_CTRL_REG_WC_SW                                    PSRAM_CTRL_REG_WC_SW
#define PSRAM_CTRL_REG_WC_SW_POS                                (0U)
#define PSRAM_CTRL_REG_WC_SW_LEN                                (6U)
#define PSRAM_CTRL_REG_WC_SW_MSK                                (((1U<<PSRAM_CTRL_REG_WC_SW_LEN)-1)<<PSRAM_CTRL_REG_WC_SW_POS)
#define PSRAM_CTRL_REG_WC_SW_UMSK                               (~(((1U<<PSRAM_CTRL_REG_WC_SW_LEN)-1)<<PSRAM_CTRL_REG_WC_SW_POS))
#define PSRAM_CTRL_REG_WC_SW_EN                                 PSRAM_CTRL_REG_WC_SW_EN
#define PSRAM_CTRL_REG_WC_SW_EN_POS                             (8U)
#define PSRAM_CTRL_REG_WC_SW_EN_LEN                             (1U)
#define PSRAM_CTRL_REG_WC_SW_EN_MSK                             (((1U<<PSRAM_CTRL_REG_WC_SW_EN_LEN)-1)<<PSRAM_CTRL_REG_WC_SW_EN_POS)
#define PSRAM_CTRL_REG_WC_SW_EN_UMSK                            (~(((1U<<PSRAM_CTRL_REG_WC_SW_EN_LEN)-1)<<PSRAM_CTRL_REG_WC_SW_EN_POS))
#define PSRAM_CTRL_REG_STATE_HOLD_TICK                          PSRAM_CTRL_REG_STATE_HOLD_TICK
#define PSRAM_CTRL_REG_STATE_HOLD_TICK_POS                      (9U)
#define PSRAM_CTRL_REG_STATE_HOLD_TICK_LEN                      (1U)
#define PSRAM_CTRL_REG_STATE_HOLD_TICK_MSK                      (((1U<<PSRAM_CTRL_REG_STATE_HOLD_TICK_LEN)-1)<<PSRAM_CTRL_REG_STATE_HOLD_TICK_POS)
#define PSRAM_CTRL_REG_STATE_HOLD_TICK_UMSK                     (~(((1U<<PSRAM_CTRL_REG_STATE_HOLD_TICK_LEN)-1)<<PSRAM_CTRL_REG_STATE_HOLD_TICK_POS))
#define PSRAM_CTRL_REG_FORCE_CEB_LOW                            PSRAM_CTRL_REG_FORCE_CEB_LOW
#define PSRAM_CTRL_REG_FORCE_CEB_LOW_POS                        (12U)
#define PSRAM_CTRL_REG_FORCE_CEB_LOW_LEN                        (1U)
#define PSRAM_CTRL_REG_FORCE_CEB_LOW_MSK                        (((1U<<PSRAM_CTRL_REG_FORCE_CEB_LOW_LEN)-1)<<PSRAM_CTRL_REG_FORCE_CEB_LOW_POS)
#define PSRAM_CTRL_REG_FORCE_CEB_LOW_UMSK                       (~(((1U<<PSRAM_CTRL_REG_FORCE_CEB_LOW_LEN)-1)<<PSRAM_CTRL_REG_FORCE_CEB_LOW_POS))
#define PSRAM_CTRL_REG_FORCE_CEB_HIGH                           PSRAM_CTRL_REG_FORCE_CEB_HIGH
#define PSRAM_CTRL_REG_FORCE_CEB_HIGH_POS                       (13U)
#define PSRAM_CTRL_REG_FORCE_CEB_HIGH_LEN                       (1U)
#define PSRAM_CTRL_REG_FORCE_CEB_HIGH_MSK                       (((1U<<PSRAM_CTRL_REG_FORCE_CEB_HIGH_LEN)-1)<<PSRAM_CTRL_REG_FORCE_CEB_HIGH_POS)
#define PSRAM_CTRL_REG_FORCE_CEB_HIGH_UMSK                      (~(((1U<<PSRAM_CTRL_REG_FORCE_CEB_HIGH_LEN)-1)<<PSRAM_CTRL_REG_FORCE_CEB_HIGH_POS))
#define PSRAM_CTRL_REG_PSRAM_RESETB                             PSRAM_CTRL_REG_PSRAM_RESETB
#define PSRAM_CTRL_REG_PSRAM_RESETB_POS                         (14U)
#define PSRAM_CTRL_REG_PSRAM_RESETB_LEN                         (1U)
#define PSRAM_CTRL_REG_PSRAM_RESETB_MSK                         (((1U<<PSRAM_CTRL_REG_PSRAM_RESETB_LEN)-1)<<PSRAM_CTRL_REG_PSRAM_RESETB_POS)
#define PSRAM_CTRL_REG_PSRAM_RESETB_UMSK                        (~(((1U<<PSRAM_CTRL_REG_PSRAM_RESETB_LEN)-1)<<PSRAM_CTRL_REG_PSRAM_RESETB_POS))
#define PSRAM_CTRL_REG_2X1X_EDGE_ALI                            PSRAM_CTRL_REG_2X1X_EDGE_ALI
#define PSRAM_CTRL_REG_2X1X_EDGE_ALI_POS                        (15U)
#define PSRAM_CTRL_REG_2X1X_EDGE_ALI_LEN                        (1U)
#define PSRAM_CTRL_REG_2X1X_EDGE_ALI_MSK                        (((1U<<PSRAM_CTRL_REG_2X1X_EDGE_ALI_LEN)-1)<<PSRAM_CTRL_REG_2X1X_EDGE_ALI_POS)
#define PSRAM_CTRL_REG_2X1X_EDGE_ALI_UMSK                       (~(((1U<<PSRAM_CTRL_REG_2X1X_EDGE_ALI_LEN)-1)<<PSRAM_CTRL_REG_2X1X_EDGE_ALI_POS))
#define PSRAM_CTRL_STS_CONFIG_READ                              PSRAM_CTRL_STS_CONFIG_READ
#define PSRAM_CTRL_STS_CONFIG_READ_POS                          (16U)
#define PSRAM_CTRL_STS_CONFIG_READ_LEN                          (16U)
#define PSRAM_CTRL_STS_CONFIG_READ_MSK                          (((1U<<PSRAM_CTRL_STS_CONFIG_READ_LEN)-1)<<PSRAM_CTRL_STS_CONFIG_READ_POS)
#define PSRAM_CTRL_STS_CONFIG_READ_UMSK                         (~(((1U<<PSRAM_CTRL_STS_CONFIG_READ_LEN)-1)<<PSRAM_CTRL_STS_CONFIG_READ_POS))

/* 0x8 : fifo_thres_control */
#define PSRAM_CTRL_FIFO_THRES_CONTROL_OFFSET                    (0x8)
#define PSRAM_CTRL_REG_MASK_W_FIFO_CNT                          PSRAM_CTRL_REG_MASK_W_FIFO_CNT
#define PSRAM_CTRL_REG_MASK_W_FIFO_CNT_POS                      (0U)
#define PSRAM_CTRL_REG_MASK_W_FIFO_CNT_LEN                      (16U)
#define PSRAM_CTRL_REG_MASK_W_FIFO_CNT_MSK                      (((1U<<PSRAM_CTRL_REG_MASK_W_FIFO_CNT_LEN)-1)<<PSRAM_CTRL_REG_MASK_W_FIFO_CNT_POS)
#define PSRAM_CTRL_REG_MASK_W_FIFO_CNT_UMSK                     (~(((1U<<PSRAM_CTRL_REG_MASK_W_FIFO_CNT_LEN)-1)<<PSRAM_CTRL_REG_MASK_W_FIFO_CNT_POS))
#define PSRAM_CTRL_REG_MASK_R_FIFO_REM                          PSRAM_CTRL_REG_MASK_R_FIFO_REM
#define PSRAM_CTRL_REG_MASK_R_FIFO_REM_POS                      (16U)
#define PSRAM_CTRL_REG_MASK_R_FIFO_REM_LEN                      (16U)
#define PSRAM_CTRL_REG_MASK_R_FIFO_REM_MSK                      (((1U<<PSRAM_CTRL_REG_MASK_R_FIFO_REM_LEN)-1)<<PSRAM_CTRL_REG_MASK_R_FIFO_REM_POS)
#define PSRAM_CTRL_REG_MASK_R_FIFO_REM_UMSK                     (~(((1U<<PSRAM_CTRL_REG_MASK_R_FIFO_REM_LEN)-1)<<PSRAM_CTRL_REG_MASK_R_FIFO_REM_POS))

/* 0xC : psram_manual_control2 */
#define PSRAM_CTRL_PSRAM_MANUAL_CONTROL2_OFFSET                 (0xC)
#define PSRAM_CTRL_REG_HOLD_CYCLE_SW                            PSRAM_CTRL_REG_HOLD_CYCLE_SW
#define PSRAM_CTRL_REG_HOLD_CYCLE_SW_POS                        (0U)
#define PSRAM_CTRL_REG_HOLD_CYCLE_SW_LEN                        (4U)
#define PSRAM_CTRL_REG_HOLD_CYCLE_SW_MSK                        (((1U<<PSRAM_CTRL_REG_HOLD_CYCLE_SW_LEN)-1)<<PSRAM_CTRL_REG_HOLD_CYCLE_SW_POS)
#define PSRAM_CTRL_REG_HOLD_CYCLE_SW_UMSK                       (~(((1U<<PSRAM_CTRL_REG_HOLD_CYCLE_SW_LEN)-1)<<PSRAM_CTRL_REG_HOLD_CYCLE_SW_POS))
#define PSRAM_CTRL_REG_HC_SW_EN                                 PSRAM_CTRL_REG_HC_SW_EN
#define PSRAM_CTRL_REG_HC_SW_EN_POS                             (4U)
#define PSRAM_CTRL_REG_HC_SW_EN_LEN                             (1U)
#define PSRAM_CTRL_REG_HC_SW_EN_MSK                             (((1U<<PSRAM_CTRL_REG_HC_SW_EN_LEN)-1)<<PSRAM_CTRL_REG_HC_SW_EN_POS)
#define PSRAM_CTRL_REG_HC_SW_EN_UMSK                            (~(((1U<<PSRAM_CTRL_REG_HC_SW_EN_LEN)-1)<<PSRAM_CTRL_REG_HC_SW_EN_POS))

/* 0x10 : winbond_psram_configure */
#define PSRAM_CTRL_WINBOND_PSRAM_CONFIGURE_OFFSET               (0x10)
#define PSRAM_CTRL_REG_WB_LATENCY                               PSRAM_CTRL_REG_WB_LATENCY
#define PSRAM_CTRL_REG_WB_LATENCY_POS                           (0U)
#define PSRAM_CTRL_REG_WB_LATENCY_LEN                           (4U)
#define PSRAM_CTRL_REG_WB_LATENCY_MSK                           (((1U<<PSRAM_CTRL_REG_WB_LATENCY_LEN)-1)<<PSRAM_CTRL_REG_WB_LATENCY_POS)
#define PSRAM_CTRL_REG_WB_LATENCY_UMSK                          (~(((1U<<PSRAM_CTRL_REG_WB_LATENCY_LEN)-1)<<PSRAM_CTRL_REG_WB_LATENCY_POS))
#define PSRAM_CTRL_REG_WB_DRIVE_ST                              PSRAM_CTRL_REG_WB_DRIVE_ST
#define PSRAM_CTRL_REG_WB_DRIVE_ST_POS                          (4U)
#define PSRAM_CTRL_REG_WB_DRIVE_ST_LEN                          (2U)
#define PSRAM_CTRL_REG_WB_DRIVE_ST_MSK                          (((1U<<PSRAM_CTRL_REG_WB_DRIVE_ST_LEN)-1)<<PSRAM_CTRL_REG_WB_DRIVE_ST_POS)
#define PSRAM_CTRL_REG_WB_DRIVE_ST_UMSK                         (~(((1U<<PSRAM_CTRL_REG_WB_DRIVE_ST_LEN)-1)<<PSRAM_CTRL_REG_WB_DRIVE_ST_POS))
#define PSRAM_CTRL_REG_WB_BURST_LENGTH                          PSRAM_CTRL_REG_WB_BURST_LENGTH
#define PSRAM_CTRL_REG_WB_BURST_LENGTH_POS                      (8U)
#define PSRAM_CTRL_REG_WB_BURST_LENGTH_LEN                      (2U)
#define PSRAM_CTRL_REG_WB_BURST_LENGTH_MSK                      (((1U<<PSRAM_CTRL_REG_WB_BURST_LENGTH_LEN)-1)<<PSRAM_CTRL_REG_WB_BURST_LENGTH_POS)
#define PSRAM_CTRL_REG_WB_BURST_LENGTH_UMSK                     (~(((1U<<PSRAM_CTRL_REG_WB_BURST_LENGTH_LEN)-1)<<PSRAM_CTRL_REG_WB_BURST_LENGTH_POS))
#define PSRAM_CTRL_REG_WB_FIX_LATENCY                           PSRAM_CTRL_REG_WB_FIX_LATENCY
#define PSRAM_CTRL_REG_WB_FIX_LATENCY_POS                       (12U)
#define PSRAM_CTRL_REG_WB_FIX_LATENCY_LEN                       (1U)
#define PSRAM_CTRL_REG_WB_FIX_LATENCY_MSK                       (((1U<<PSRAM_CTRL_REG_WB_FIX_LATENCY_LEN)-1)<<PSRAM_CTRL_REG_WB_FIX_LATENCY_POS)
#define PSRAM_CTRL_REG_WB_FIX_LATENCY_UMSK                      (~(((1U<<PSRAM_CTRL_REG_WB_FIX_LATENCY_LEN)-1)<<PSRAM_CTRL_REG_WB_FIX_LATENCY_POS))
#define PSRAM_CTRL_REG_WB_DPD_DIS                               PSRAM_CTRL_REG_WB_DPD_DIS
#define PSRAM_CTRL_REG_WB_DPD_DIS_POS                           (13U)
#define PSRAM_CTRL_REG_WB_DPD_DIS_LEN                           (1U)
#define PSRAM_CTRL_REG_WB_DPD_DIS_MSK                           (((1U<<PSRAM_CTRL_REG_WB_DPD_DIS_LEN)-1)<<PSRAM_CTRL_REG_WB_DPD_DIS_POS)
#define PSRAM_CTRL_REG_WB_DPD_DIS_UMSK                          (~(((1U<<PSRAM_CTRL_REG_WB_DPD_DIS_LEN)-1)<<PSRAM_CTRL_REG_WB_DPD_DIS_POS))
#define PSRAM_CTRL_REG_WB_PASR                                  PSRAM_CTRL_REG_WB_PASR
#define PSRAM_CTRL_REG_WB_PASR_POS                              (16U)
#define PSRAM_CTRL_REG_WB_PASR_LEN                              (3U)
#define PSRAM_CTRL_REG_WB_PASR_MSK                              (((1U<<PSRAM_CTRL_REG_WB_PASR_LEN)-1)<<PSRAM_CTRL_REG_WB_PASR_POS)
#define PSRAM_CTRL_REG_WB_PASR_UMSK                             (~(((1U<<PSRAM_CTRL_REG_WB_PASR_LEN)-1)<<PSRAM_CTRL_REG_WB_PASR_POS))
#define PSRAM_CTRL_REG_WB_HYBRID_SLP                            PSRAM_CTRL_REG_WB_HYBRID_SLP
#define PSRAM_CTRL_REG_WB_HYBRID_SLP_POS                        (20U)
#define PSRAM_CTRL_REG_WB_HYBRID_SLP_LEN                        (1U)
#define PSRAM_CTRL_REG_WB_HYBRID_SLP_MSK                        (((1U<<PSRAM_CTRL_REG_WB_HYBRID_SLP_LEN)-1)<<PSRAM_CTRL_REG_WB_HYBRID_SLP_POS)
#define PSRAM_CTRL_REG_WB_HYBRID_SLP_UMSK                       (~(((1U<<PSRAM_CTRL_REG_WB_HYBRID_SLP_LEN)-1)<<PSRAM_CTRL_REG_WB_HYBRID_SLP_POS))

/* 0x14 : winbond_psram_status */
#define PSRAM_CTRL_WINBOND_PSRAM_STATUS_OFFSET                  (0x14)
#define PSRAM_CTRL_STS_WB_LATENCY                               PSRAM_CTRL_STS_WB_LATENCY
#define PSRAM_CTRL_STS_WB_LATENCY_POS                           (0U)
#define PSRAM_CTRL_STS_WB_LATENCY_LEN                           (4U)
#define PSRAM_CTRL_STS_WB_LATENCY_MSK                           (((1U<<PSRAM_CTRL_STS_WB_LATENCY_LEN)-1)<<PSRAM_CTRL_STS_WB_LATENCY_POS)
#define PSRAM_CTRL_STS_WB_LATENCY_UMSK                          (~(((1U<<PSRAM_CTRL_STS_WB_LATENCY_LEN)-1)<<PSRAM_CTRL_STS_WB_LATENCY_POS))
#define PSRAM_CTRL_STS_WB_DRIVE_ST                              PSRAM_CTRL_STS_WB_DRIVE_ST
#define PSRAM_CTRL_STS_WB_DRIVE_ST_POS                          (4U)
#define PSRAM_CTRL_STS_WB_DRIVE_ST_LEN                          (2U)
#define PSRAM_CTRL_STS_WB_DRIVE_ST_MSK                          (((1U<<PSRAM_CTRL_STS_WB_DRIVE_ST_LEN)-1)<<PSRAM_CTRL_STS_WB_DRIVE_ST_POS)
#define PSRAM_CTRL_STS_WB_DRIVE_ST_UMSK                         (~(((1U<<PSRAM_CTRL_STS_WB_DRIVE_ST_LEN)-1)<<PSRAM_CTRL_STS_WB_DRIVE_ST_POS))
#define PSRAM_CTRL_STS_WB_BURST_LENGTH                          PSRAM_CTRL_STS_WB_BURST_LENGTH
#define PSRAM_CTRL_STS_WB_BURST_LENGTH_POS                      (8U)
#define PSRAM_CTRL_STS_WB_BURST_LENGTH_LEN                      (2U)
#define PSRAM_CTRL_STS_WB_BURST_LENGTH_MSK                      (((1U<<PSRAM_CTRL_STS_WB_BURST_LENGTH_LEN)-1)<<PSRAM_CTRL_STS_WB_BURST_LENGTH_POS)
#define PSRAM_CTRL_STS_WB_BURST_LENGTH_UMSK                     (~(((1U<<PSRAM_CTRL_STS_WB_BURST_LENGTH_LEN)-1)<<PSRAM_CTRL_STS_WB_BURST_LENGTH_POS))
#define PSRAM_CTRL_STS_WB_FIX_LATENCY                           PSRAM_CTRL_STS_WB_FIX_LATENCY
#define PSRAM_CTRL_STS_WB_FIX_LATENCY_POS                       (12U)
#define PSRAM_CTRL_STS_WB_FIX_LATENCY_LEN                       (1U)
#define PSRAM_CTRL_STS_WB_FIX_LATENCY_MSK                       (((1U<<PSRAM_CTRL_STS_WB_FIX_LATENCY_LEN)-1)<<PSRAM_CTRL_STS_WB_FIX_LATENCY_POS)
#define PSRAM_CTRL_STS_WB_FIX_LATENCY_UMSK                      (~(((1U<<PSRAM_CTRL_STS_WB_FIX_LATENCY_LEN)-1)<<PSRAM_CTRL_STS_WB_FIX_LATENCY_POS))
#define PSRAM_CTRL_STS_WB_DPD_DIS                               PSRAM_CTRL_STS_WB_DPD_DIS
#define PSRAM_CTRL_STS_WB_DPD_DIS_POS                           (13U)
#define PSRAM_CTRL_STS_WB_DPD_DIS_LEN                           (1U)
#define PSRAM_CTRL_STS_WB_DPD_DIS_MSK                           (((1U<<PSRAM_CTRL_STS_WB_DPD_DIS_LEN)-1)<<PSRAM_CTRL_STS_WB_DPD_DIS_POS)
#define PSRAM_CTRL_STS_WB_DPD_DIS_UMSK                          (~(((1U<<PSRAM_CTRL_STS_WB_DPD_DIS_LEN)-1)<<PSRAM_CTRL_STS_WB_DPD_DIS_POS))
#define PSRAM_CTRL_STS_WB_PASR                                  PSRAM_CTRL_STS_WB_PASR
#define PSRAM_CTRL_STS_WB_PASR_POS                              (16U)
#define PSRAM_CTRL_STS_WB_PASR_LEN                              (3U)
#define PSRAM_CTRL_STS_WB_PASR_MSK                              (((1U<<PSRAM_CTRL_STS_WB_PASR_LEN)-1)<<PSRAM_CTRL_STS_WB_PASR_POS)
#define PSRAM_CTRL_STS_WB_PASR_UMSK                             (~(((1U<<PSRAM_CTRL_STS_WB_PASR_LEN)-1)<<PSRAM_CTRL_STS_WB_PASR_POS))
#define PSRAM_CTRL_STS_WB_HYBRID_SLP                            PSRAM_CTRL_STS_WB_HYBRID_SLP
#define PSRAM_CTRL_STS_WB_HYBRID_SLP_POS                        (20U)
#define PSRAM_CTRL_STS_WB_HYBRID_SLP_LEN                        (1U)
#define PSRAM_CTRL_STS_WB_HYBRID_SLP_MSK                        (((1U<<PSRAM_CTRL_STS_WB_HYBRID_SLP_LEN)-1)<<PSRAM_CTRL_STS_WB_HYBRID_SLP_POS)
#define PSRAM_CTRL_STS_WB_HYBRID_SLP_UMSK                       (~(((1U<<PSRAM_CTRL_STS_WB_HYBRID_SLP_LEN)-1)<<PSRAM_CTRL_STS_WB_HYBRID_SLP_POS))

/* 0x20 : apmemory_psram_configure */
#define PSRAM_CTRL_APMEMORY_PSRAM_CONFIGURE_OFFSET              (0x20)
#define PSRAM_CTRL_REG_AP_BURST_LENGTH                          PSRAM_CTRL_REG_AP_BURST_LENGTH
#define PSRAM_CTRL_REG_AP_BURST_LENGTH_POS                      (0U)
#define PSRAM_CTRL_REG_AP_BURST_LENGTH_LEN                      (2U)
#define PSRAM_CTRL_REG_AP_BURST_LENGTH_MSK                      (((1U<<PSRAM_CTRL_REG_AP_BURST_LENGTH_LEN)-1)<<PSRAM_CTRL_REG_AP_BURST_LENGTH_POS)
#define PSRAM_CTRL_REG_AP_BURST_LENGTH_UMSK                     (~(((1U<<PSRAM_CTRL_REG_AP_BURST_LENGTH_LEN)-1)<<PSRAM_CTRL_REG_AP_BURST_LENGTH_POS))
#define PSRAM_CTRL_REG_AP_BURST_TYPE                            PSRAM_CTRL_REG_AP_BURST_TYPE
#define PSRAM_CTRL_REG_AP_BURST_TYPE_POS                        (4U)
#define PSRAM_CTRL_REG_AP_BURST_TYPE_LEN                        (1U)
#define PSRAM_CTRL_REG_AP_BURST_TYPE_MSK                        (((1U<<PSRAM_CTRL_REG_AP_BURST_TYPE_LEN)-1)<<PSRAM_CTRL_REG_AP_BURST_TYPE_POS)
#define PSRAM_CTRL_REG_AP_BURST_TYPE_UMSK                       (~(((1U<<PSRAM_CTRL_REG_AP_BURST_TYPE_LEN)-1)<<PSRAM_CTRL_REG_AP_BURST_TYPE_POS))
#define PSRAM_CTRL_REG_AP_RBX                                   PSRAM_CTRL_REG_AP_RBX
#define PSRAM_CTRL_REG_AP_RBX_POS                               (5U)
#define PSRAM_CTRL_REG_AP_RBX_LEN                               (1U)
#define PSRAM_CTRL_REG_AP_RBX_MSK                               (((1U<<PSRAM_CTRL_REG_AP_RBX_LEN)-1)<<PSRAM_CTRL_REG_AP_RBX_POS)
#define PSRAM_CTRL_REG_AP_RBX_UMSK                              (~(((1U<<PSRAM_CTRL_REG_AP_RBX_LEN)-1)<<PSRAM_CTRL_REG_AP_RBX_POS))
#define PSRAM_CTRL_REG_AP_RF                                    PSRAM_CTRL_REG_AP_RF
#define PSRAM_CTRL_REG_AP_RF_POS                                (6U)
#define PSRAM_CTRL_REG_AP_RF_LEN                                (1U)
#define PSRAM_CTRL_REG_AP_RF_MSK                                (((1U<<PSRAM_CTRL_REG_AP_RF_LEN)-1)<<PSRAM_CTRL_REG_AP_RF_POS)
#define PSRAM_CTRL_REG_AP_RF_UMSK                               (~(((1U<<PSRAM_CTRL_REG_AP_RF_LEN)-1)<<PSRAM_CTRL_REG_AP_RF_POS))
#define PSRAM_CTRL_REG_AP_PASR                                  PSRAM_CTRL_REG_AP_PASR
#define PSRAM_CTRL_REG_AP_PASR_POS                              (8U)
#define PSRAM_CTRL_REG_AP_PASR_LEN                              (3U)
#define PSRAM_CTRL_REG_AP_PASR_MSK                              (((1U<<PSRAM_CTRL_REG_AP_PASR_LEN)-1)<<PSRAM_CTRL_REG_AP_PASR_POS)
#define PSRAM_CTRL_REG_AP_PASR_UMSK                             (~(((1U<<PSRAM_CTRL_REG_AP_PASR_LEN)-1)<<PSRAM_CTRL_REG_AP_PASR_POS))
#define PSRAM_CTRL_REG_AP_W_LATENCY_CODE                        PSRAM_CTRL_REG_AP_W_LATENCY_CODE
#define PSRAM_CTRL_REG_AP_W_LATENCY_CODE_POS                    (12U)
#define PSRAM_CTRL_REG_AP_W_LATENCY_CODE_LEN                    (3U)
#define PSRAM_CTRL_REG_AP_W_LATENCY_CODE_MSK                    (((1U<<PSRAM_CTRL_REG_AP_W_LATENCY_CODE_LEN)-1)<<PSRAM_CTRL_REG_AP_W_LATENCY_CODE_POS)
#define PSRAM_CTRL_REG_AP_W_LATENCY_CODE_UMSK                   (~(((1U<<PSRAM_CTRL_REG_AP_W_LATENCY_CODE_LEN)-1)<<PSRAM_CTRL_REG_AP_W_LATENCY_CODE_POS))
#define PSRAM_CTRL_REG_AP_DRIVE_ST                              PSRAM_CTRL_REG_AP_DRIVE_ST
#define PSRAM_CTRL_REG_AP_DRIVE_ST_POS                          (16U)
#define PSRAM_CTRL_REG_AP_DRIVE_ST_LEN                          (2U)
#define PSRAM_CTRL_REG_AP_DRIVE_ST_MSK                          (((1U<<PSRAM_CTRL_REG_AP_DRIVE_ST_LEN)-1)<<PSRAM_CTRL_REG_AP_DRIVE_ST_POS)
#define PSRAM_CTRL_REG_AP_DRIVE_ST_UMSK                         (~(((1U<<PSRAM_CTRL_REG_AP_DRIVE_ST_LEN)-1)<<PSRAM_CTRL_REG_AP_DRIVE_ST_POS))
#define PSRAM_CTRL_REG_AP_R_LATENCY_CODE                        PSRAM_CTRL_REG_AP_R_LATENCY_CODE
#define PSRAM_CTRL_REG_AP_R_LATENCY_CODE_POS                    (20U)
#define PSRAM_CTRL_REG_AP_R_LATENCY_CODE_LEN                    (3U)
#define PSRAM_CTRL_REG_AP_R_LATENCY_CODE_MSK                    (((1U<<PSRAM_CTRL_REG_AP_R_LATENCY_CODE_LEN)-1)<<PSRAM_CTRL_REG_AP_R_LATENCY_CODE_POS)
#define PSRAM_CTRL_REG_AP_R_LATENCY_CODE_UMSK                   (~(((1U<<PSRAM_CTRL_REG_AP_R_LATENCY_CODE_LEN)-1)<<PSRAM_CTRL_REG_AP_R_LATENCY_CODE_POS))
#define PSRAM_CTRL_REG_AP_R_LATENCY_TYPE                        PSRAM_CTRL_REG_AP_R_LATENCY_TYPE
#define PSRAM_CTRL_REG_AP_R_LATENCY_TYPE_POS                    (24U)
#define PSRAM_CTRL_REG_AP_R_LATENCY_TYPE_LEN                    (1U)
#define PSRAM_CTRL_REG_AP_R_LATENCY_TYPE_MSK                    (((1U<<PSRAM_CTRL_REG_AP_R_LATENCY_TYPE_LEN)-1)<<PSRAM_CTRL_REG_AP_R_LATENCY_TYPE_POS)
#define PSRAM_CTRL_REG_AP_R_LATENCY_TYPE_UMSK                   (~(((1U<<PSRAM_CTRL_REG_AP_R_LATENCY_TYPE_LEN)-1)<<PSRAM_CTRL_REG_AP_R_LATENCY_TYPE_POS))
#define PSRAM_CTRL_REG_AP_LINEAR_DIS                            PSRAM_CTRL_REG_AP_LINEAR_DIS
#define PSRAM_CTRL_REG_AP_LINEAR_DIS_POS                        (25U)
#define PSRAM_CTRL_REG_AP_LINEAR_DIS_LEN                        (1U)
#define PSRAM_CTRL_REG_AP_LINEAR_DIS_MSK                        (((1U<<PSRAM_CTRL_REG_AP_LINEAR_DIS_LEN)-1)<<PSRAM_CTRL_REG_AP_LINEAR_DIS_POS)
#define PSRAM_CTRL_REG_AP_LINEAR_DIS_UMSK                       (~(((1U<<PSRAM_CTRL_REG_AP_LINEAR_DIS_LEN)-1)<<PSRAM_CTRL_REG_AP_LINEAR_DIS_POS))
#define PSRAM_CTRL_REG_AP_GLB_RESET_PULSE                       PSRAM_CTRL_REG_AP_GLB_RESET_PULSE
#define PSRAM_CTRL_REG_AP_GLB_RESET_PULSE_POS                   (28U)
#define PSRAM_CTRL_REG_AP_GLB_RESET_PULSE_LEN                   (1U)
#define PSRAM_CTRL_REG_AP_GLB_RESET_PULSE_MSK                   (((1U<<PSRAM_CTRL_REG_AP_GLB_RESET_PULSE_LEN)-1)<<PSRAM_CTRL_REG_AP_GLB_RESET_PULSE_POS)
#define PSRAM_CTRL_REG_AP_GLB_RESET_PULSE_UMSK                  (~(((1U<<PSRAM_CTRL_REG_AP_GLB_RESET_PULSE_LEN)-1)<<PSRAM_CTRL_REG_AP_GLB_RESET_PULSE_POS))

