bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/Peripherals/psram_ctrl_reg.h
/* 0x24 : apmemory_psram_status */
#define PSRAM_CTRL_APMEMORY_PSRAM_STATUS_OFFSET                 (0x24)
#define PSRAM_CTRL_STS_AP_BURST_LENGTH                          PSRAM_CTRL_STS_AP_BURST_LENGTH
#define PSRAM_CTRL_STS_AP_BURST_LENGTH_POS                      (0U)
#define PSRAM_CTRL_STS_AP_BURST_LENGTH_LEN                      (2U)
#define PSRAM_CTRL_STS_AP_BURST_LENGTH_MSK                      (((1U<<PSRAM_CTRL_STS_AP_BURST_LENGTH_LEN)-1)<<PSRAM_CTRL_STS_AP_BURST_LENGTH_POS)
#define PSRAM_CTRL_STS_AP_BURST_LENGTH_UMSK                     (~(((1U<<PSRAM_CTRL_STS_AP_BURST_LENGTH_LEN)-1)<<PSRAM_CTRL_STS_AP_BURST_LENGTH_POS))
#define PSRAM_CTRL_STS_AP_BURST_TYPE                            PSRAM_CTRL_STS_AP_BURST_TYPE
#define PSRAM_CTRL_STS_AP_BURST_TYPE_POS                        (4U)
#define PSRAM_CTRL_STS_AP_BURST_TYPE_LEN                        (1U)
#define PSRAM_CTRL_STS_AP_BURST_TYPE_MSK                        (((1U<<PSRAM_CTRL_STS_AP_BURST_TYPE_LEN)-1)<<PSRAM_CTRL_STS_AP_BURST_TYPE_POS)
#define PSRAM_CTRL_STS_AP_BURST_TYPE_UMSK                       (~(((1U<<PSRAM_CTRL_STS_AP_BURST_TYPE_LEN)-1)<<PSRAM_CTRL_STS_AP_BURST_TYPE_POS))
#define PSRAM_CTRL_STS_AP_RBX                                   PSRAM_CTRL_STS_AP_RBX
#define PSRAM_CTRL_STS_AP_RBX_POS                               (5U)
#define PSRAM_CTRL_STS_AP_RBX_LEN                               (1U)
#define PSRAM_CTRL_STS_AP_RBX_MSK                               (((1U<<PSRAM_CTRL_STS_AP_RBX_LEN)-1)<<PSRAM_CTRL_STS_AP_RBX_POS)
#define PSRAM_CTRL_STS_AP_RBX_UMSK                              (~(((1U<<PSRAM_CTRL_STS_AP_RBX_LEN)-1)<<PSRAM_CTRL_STS_AP_RBX_POS))
#define PSRAM_CTRL_STS_AP_RF                                    PSRAM_CTRL_STS_AP_RF
#define PSRAM_CTRL_STS_AP_RF_POS                                (6U)
#define PSRAM_CTRL_STS_AP_RF_LEN                                (1U)
#define PSRAM_CTRL_STS_AP_RF_MSK                                (((1U<<PSRAM_CTRL_STS_AP_RF_LEN)-1)<<PSRAM_CTRL_STS_AP_RF_POS)
#define PSRAM_CTRL_STS_AP_RF_UMSK                               (~(((1U<<PSRAM_CTRL_STS_AP_RF_LEN)-1)<<PSRAM_CTRL_STS_AP_RF_POS))
#define PSRAM_CTRL_STS_AP_PASR                                  PSRAM_CTRL_STS_AP_PASR
#define PSRAM_CTRL_STS_AP_PASR_POS                              (8U)
#define PSRAM_CTRL_STS_AP_PASR_LEN                              (3U)
#define PSRAM_CTRL_STS_AP_PASR_MSK                              (((1U<<PSRAM_CTRL_STS_AP_PASR_LEN)-1)<<PSRAM_CTRL_STS_AP_PASR_POS)
#define PSRAM_CTRL_STS_AP_PASR_UMSK                             (~(((1U<<PSRAM_CTRL_STS_AP_PASR_LEN)-1)<<PSRAM_CTRL_STS_AP_PASR_POS))
#define PSRAM_CTRL_STS_AP_W_LATENCY_CODE                        PSRAM_CTRL_STS_AP_W_LATENCY_CODE
#define PSRAM_CTRL_STS_AP_W_LATENCY_CODE_POS                    (12U)
#define PSRAM_CTRL_STS_AP_W_LATENCY_CODE_LEN                    (3U)
#define PSRAM_CTRL_STS_AP_W_LATENCY_CODE_MSK                    (((1U<<PSRAM_CTRL_STS_AP_W_LATENCY_CODE_LEN)-1)<<PSRAM_CTRL_STS_AP_W_LATENCY_CODE_POS)
#define PSRAM_CTRL_STS_AP_W_LATENCY_CODE_UMSK                   (~(((1U<<PSRAM_CTRL_STS_AP_W_LATENCY_CODE_LEN)-1)<<PSRAM_CTRL_STS_AP_W_LATENCY_CODE_POS))
#define PSRAM_CTRL_STS_AP_DRIVE_ST                              PSRAM_CTRL_STS_AP_DRIVE_ST
#define PSRAM_CTRL_STS_AP_DRIVE_ST_POS                          (16U)
#define PSRAM_CTRL_STS_AP_DRIVE_ST_LEN                          (2U)
#define PSRAM_CTRL_STS_AP_DRIVE_ST_MSK                          (((1U<<PSRAM_CTRL_STS_AP_DRIVE_ST_LEN)-1)<<PSRAM_CTRL_STS_AP_DRIVE_ST_POS)
#define PSRAM_CTRL_STS_AP_DRIVE_ST_UMSK                         (~(((1U<<PSRAM_CTRL_STS_AP_DRIVE_ST_LEN)-1)<<PSRAM_CTRL_STS_AP_DRIVE_ST_POS))
#define PSRAM_CTRL_STS_AP_R_LATENCY_CODE                        PSRAM_CTRL_STS_AP_R_LATENCY_CODE
#define PSRAM_CTRL_STS_AP_R_LATENCY_CODE_POS                    (20U)
#define PSRAM_CTRL_STS_AP_R_LATENCY_CODE_LEN                    (3U)
#define PSRAM_CTRL_STS_AP_R_LATENCY_CODE_MSK                    (((1U<<PSRAM_CTRL_STS_AP_R_LATENCY_CODE_LEN)-1)<<PSRAM_CTRL_STS_AP_R_LATENCY_CODE_POS)
#define PSRAM_CTRL_STS_AP_R_LATENCY_CODE_UMSK                   (~(((1U<<PSRAM_CTRL_STS_AP_R_LATENCY_CODE_LEN)-1)<<PSRAM_CTRL_STS_AP_R_LATENCY_CODE_POS))
#define PSRAM_CTRL_STS_AP_R_LATENCY_TYPE                        PSRAM_CTRL_STS_AP_R_LATENCY_TYPE
#define PSRAM_CTRL_STS_AP_R_LATENCY_TYPE_POS                    (24U)
#define PSRAM_CTRL_STS_AP_R_LATENCY_TYPE_LEN                    (1U)
#define PSRAM_CTRL_STS_AP_R_LATENCY_TYPE_MSK                    (((1U<<PSRAM_CTRL_STS_AP_R_LATENCY_TYPE_LEN)-1)<<PSRAM_CTRL_STS_AP_R_LATENCY_TYPE_POS)
#define PSRAM_CTRL_STS_AP_R_LATENCY_TYPE_UMSK                   (~(((1U<<PSRAM_CTRL_STS_AP_R_LATENCY_TYPE_LEN)-1)<<PSRAM_CTRL_STS_AP_R_LATENCY_TYPE_POS))

/* 0x80 : psram_intf_delay_ctrl0 */
#define PSRAM_CTRL_PSRAM_INTF_DELAY_CTRL0_OFFSET                (0x80)
#define PSRAM_CTRL_REG_DELAY_SEL_O_DQS_OEN                      PSRAM_CTRL_REG_DELAY_SEL_O_DQS_OEN
#define PSRAM_CTRL_REG_DELAY_SEL_O_DQS_OEN_POS                  (0U)
#define PSRAM_CTRL_REG_DELAY_SEL_O_DQS_OEN_LEN                  (8U)
#define PSRAM_CTRL_REG_DELAY_SEL_O_DQS_OEN_MSK                  (((1U<<PSRAM_CTRL_REG_DELAY_SEL_O_DQS_OEN_LEN)-1)<<PSRAM_CTRL_REG_DELAY_SEL_O_DQS_OEN_POS)
#define PSRAM_CTRL_REG_DELAY_SEL_O_DQS_OEN_UMSK                 (~(((1U<<PSRAM_CTRL_REG_DELAY_SEL_O_DQS_OEN_LEN)-1)<<PSRAM_CTRL_REG_DELAY_SEL_O_DQS_OEN_POS))
#define PSRAM_CTRL_REG_DELAY_SEL_O_CEB                          PSRAM_CTRL_REG_DELAY_SEL_O_CEB
#define PSRAM_CTRL_REG_DELAY_SEL_O_CEB_POS                      (8U)
#define PSRAM_CTRL_REG_DELAY_SEL_O_CEB_LEN                      (8U)
#define PSRAM_CTRL_REG_DELAY_SEL_O_CEB_MSK                      (((1U<<PSRAM_CTRL_REG_DELAY_SEL_O_CEB_LEN)-1)<<PSRAM_CTRL_REG_DELAY_SEL_O_CEB_POS)
#define PSRAM_CTRL_REG_DELAY_SEL_O_CEB_UMSK                     (~(((1U<<PSRAM_CTRL_REG_DELAY_SEL_O_CEB_LEN)-1)<<PSRAM_CTRL_REG_DELAY_SEL_O_CEB_POS))
#define PSRAM_CTRL_REG_DELAY_SEL_O_CLK_N                        PSRAM_CTRL_REG_DELAY_SEL_O_CLK_N
#define PSRAM_CTRL_REG_DELAY_SEL_O_CLK_N_POS                    (16U)
#define PSRAM_CTRL_REG_DELAY_SEL_O_CLK_N_LEN                    (8U)
#define PSRAM_CTRL_REG_DELAY_SEL_O_CLK_N_MSK                    (((1U<<PSRAM_CTRL_REG_DELAY_SEL_O_CLK_N_LEN)-1)<<PSRAM_CTRL_REG_DELAY_SEL_O_CLK_N_POS)
#define PSRAM_CTRL_REG_DELAY_SEL_O_CLK_N_UMSK                   (~(((1U<<PSRAM_CTRL_REG_DELAY_SEL_O_CLK_N_LEN)-1)<<PSRAM_CTRL_REG_DELAY_SEL_O_CLK_N_POS))
#define PSRAM_CTRL_REG_DELAY_SEL_O_CLK                          PSRAM_CTRL_REG_DELAY_SEL_O_CLK
#define PSRAM_CTRL_REG_DELAY_SEL_O_CLK_POS                      (24U)
#define PSRAM_CTRL_REG_DELAY_SEL_O_CLK_LEN                      (8U)
#define PSRAM_CTRL_REG_DELAY_SEL_O_CLK_MSK                      (((1U<<PSRAM_CTRL_REG_DELAY_SEL_O_CLK_LEN)-1)<<PSRAM_CTRL_REG_DELAY_SEL_O_CLK_POS)
#define PSRAM_CTRL_REG_DELAY_SEL_O_CLK_UMSK                     (~(((1U<<PSRAM_CTRL_REG_DELAY_SEL_O_CLK_LEN)-1)<<PSRAM_CTRL_REG_DELAY_SEL_O_CLK_POS))

/* 0x84 : psram_intf_delay_ctrl1 */
#define PSRAM_CTRL_PSRAM_INTF_DELAY_CTRL1_OFFSET                (0x84)
#define PSRAM_CTRL_REG_DELAY_SEL_O_ADQ1                         PSRAM_CTRL_REG_DELAY_SEL_O_ADQ1
#define PSRAM_CTRL_REG_DELAY_SEL_O_ADQ1_POS                     (0U)
#define PSRAM_CTRL_REG_DELAY_SEL_O_ADQ1_LEN                     (8U)
#define PSRAM_CTRL_REG_DELAY_SEL_O_ADQ1_MSK                     (((1U<<PSRAM_CTRL_REG_DELAY_SEL_O_ADQ1_LEN)-1)<<PSRAM_CTRL_REG_DELAY_SEL_O_ADQ1_POS)
#define PSRAM_CTRL_REG_DELAY_SEL_O_ADQ1_UMSK                    (~(((1U<<PSRAM_CTRL_REG_DELAY_SEL_O_ADQ1_LEN)-1)<<PSRAM_CTRL_REG_DELAY_SEL_O_ADQ1_POS))
#define PSRAM_CTRL_REG_DELAY_SEL_O_ADQ0                         PSRAM_CTRL_REG_DELAY_SEL_O_ADQ0
#define PSRAM_CTRL_REG_DELAY_SEL_O_ADQ0_POS                     (8U)
#define PSRAM_CTRL_REG_DELAY_SEL_O_ADQ0_LEN                     (8U)
#define PSRAM_CTRL_REG_DELAY_SEL_O_ADQ0_MSK                     (((1U<<PSRAM_CTRL_REG_DELAY_SEL_O_ADQ0_LEN)-1)<<PSRAM_CTRL_REG_DELAY_SEL_O_ADQ0_POS)
#define PSRAM_CTRL_REG_DELAY_SEL_O_ADQ0_UMSK                    (~(((1U<<PSRAM_CTRL_REG_DELAY_SEL_O_ADQ0_LEN)-1)<<PSRAM_CTRL_REG_DELAY_SEL_O_ADQ0_POS))
#define PSRAM_CTRL_REG_DELAY_SEL_O_ADQ_OEN                      PSRAM_CTRL_REG_DELAY_SEL_O_ADQ_OEN
#define PSRAM_CTRL_REG_DELAY_SEL_O_ADQ_OEN_POS                  (16U)
#define PSRAM_CTRL_REG_DELAY_SEL_O_ADQ_OEN_LEN                  (8U)
#define PSRAM_CTRL_REG_DELAY_SEL_O_ADQ_OEN_MSK                  (((1U<<PSRAM_CTRL_REG_DELAY_SEL_O_ADQ_OEN_LEN)-1)<<PSRAM_CTRL_REG_DELAY_SEL_O_ADQ_OEN_POS)
#define PSRAM_CTRL_REG_DELAY_SEL_O_ADQ_OEN_UMSK                 (~(((1U<<PSRAM_CTRL_REG_DELAY_SEL_O_ADQ_OEN_LEN)-1)<<PSRAM_CTRL_REG_DELAY_SEL_O_ADQ_OEN_POS))
#define PSRAM_CTRL_REG_DELAY_SEL_O_DQS                          PSRAM_CTRL_REG_DELAY_SEL_O_DQS
#define PSRAM_CTRL_REG_DELAY_SEL_O_DQS_POS                      (24U)
#define PSRAM_CTRL_REG_DELAY_SEL_O_DQS_LEN                      (8U)
#define PSRAM_CTRL_REG_DELAY_SEL_O_DQS_MSK                      (((1U<<PSRAM_CTRL_REG_DELAY_SEL_O_DQS_LEN)-1)<<PSRAM_CTRL_REG_DELAY_SEL_O_DQS_POS)
#define PSRAM_CTRL_REG_DELAY_SEL_O_DQS_UMSK                     (~(((1U<<PSRAM_CTRL_REG_DELAY_SEL_O_DQS_LEN)-1)<<PSRAM_CTRL_REG_DELAY_SEL_O_DQS_POS))

/* 0x88 : psram_intf_delay_ctrl2 */
#define PSRAM_CTRL_PSRAM_INTF_DELAY_CTRL2_OFFSET                (0x88)
#define PSRAM_CTRL_REG_DELAY_SEL_O_ADQ5                         PSRAM_CTRL_REG_DELAY_SEL_O_ADQ5
#define PSRAM_CTRL_REG_DELAY_SEL_O_ADQ5_POS                     (0U)
#define PSRAM_CTRL_REG_DELAY_SEL_O_ADQ5_LEN                     (8U)
#define PSRAM_CTRL_REG_DELAY_SEL_O_ADQ5_MSK                     (((1U<<PSRAM_CTRL_REG_DELAY_SEL_O_ADQ5_LEN)-1)<<PSRAM_CTRL_REG_DELAY_SEL_O_ADQ5_POS)
#define PSRAM_CTRL_REG_DELAY_SEL_O_ADQ5_UMSK                    (~(((1U<<PSRAM_CTRL_REG_DELAY_SEL_O_ADQ5_LEN)-1)<<PSRAM_CTRL_REG_DELAY_SEL_O_ADQ5_POS))
#define PSRAM_CTRL_REG_DELAY_SEL_O_ADQ4                         PSRAM_CTRL_REG_DELAY_SEL_O_ADQ4
#define PSRAM_CTRL_REG_DELAY_SEL_O_ADQ4_POS                     (8U)
#define PSRAM_CTRL_REG_DELAY_SEL_O_ADQ4_LEN                     (8U)
#define PSRAM_CTRL_REG_DELAY_SEL_O_ADQ4_MSK                     (((1U<<PSRAM_CTRL_REG_DELAY_SEL_O_ADQ4_LEN)-1)<<PSRAM_CTRL_REG_DELAY_SEL_O_ADQ4_POS)
#define PSRAM_CTRL_REG_DELAY_SEL_O_ADQ4_UMSK                    (~(((1U<<PSRAM_CTRL_REG_DELAY_SEL_O_ADQ4_LEN)-1)<<PSRAM_CTRL_REG_DELAY_SEL_O_ADQ4_POS))
#define PSRAM_CTRL_REG_DELAY_SEL_O_ADQ3                         PSRAM_CTRL_REG_DELAY_SEL_O_ADQ3
#define PSRAM_CTRL_REG_DELAY_SEL_O_ADQ3_POS                     (16U)
#define PSRAM_CTRL_REG_DELAY_SEL_O_ADQ3_LEN                     (8U)
#define PSRAM_CTRL_REG_DELAY_SEL_O_ADQ3_MSK                     (((1U<<PSRAM_CTRL_REG_DELAY_SEL_O_ADQ3_LEN)-1)<<PSRAM_CTRL_REG_DELAY_SEL_O_ADQ3_POS)
#define PSRAM_CTRL_REG_DELAY_SEL_O_ADQ3_UMSK                    (~(((1U<<PSRAM_CTRL_REG_DELAY_SEL_O_ADQ3_LEN)-1)<<PSRAM_CTRL_REG_DELAY_SEL_O_ADQ3_POS))
#define PSRAM_CTRL_REG_DELAY_SEL_O_ADQ2                         PSRAM_CTRL_REG_DELAY_SEL_O_ADQ2
#define PSRAM_CTRL_REG_DELAY_SEL_O_ADQ2_POS                     (24U)
#define PSRAM_CTRL_REG_DELAY_SEL_O_ADQ2_LEN                     (8U)
#define PSRAM_CTRL_REG_DELAY_SEL_O_ADQ2_MSK                     (((1U<<PSRAM_CTRL_REG_DELAY_SEL_O_ADQ2_LEN)-1)<<PSRAM_CTRL_REG_DELAY_SEL_O_ADQ2_POS)
#define PSRAM_CTRL_REG_DELAY_SEL_O_ADQ2_UMSK                    (~(((1U<<PSRAM_CTRL_REG_DELAY_SEL_O_ADQ2_LEN)-1)<<PSRAM_CTRL_REG_DELAY_SEL_O_ADQ2_POS))

