bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/Peripherals/psram_ctrl_reg.h
/* 0x8C : psram_intf_delay_ctrl3 */
#define PSRAM_CTRL_PSRAM_INTF_DELAY_CTRL3_OFFSET                (0x8C)
#define PSRAM_CTRL_REG_DELAY_SEL_I_ADQ1                         PSRAM_CTRL_REG_DELAY_SEL_I_ADQ1
#define PSRAM_CTRL_REG_DELAY_SEL_I_ADQ1_POS                     (0U)
#define PSRAM_CTRL_REG_DELAY_SEL_I_ADQ1_LEN                     (8U)
#define PSRAM_CTRL_REG_DELAY_SEL_I_ADQ1_MSK                     (((1U<<PSRAM_CTRL_REG_DELAY_SEL_I_ADQ1_LEN)-1)<<PSRAM_CTRL_REG_DELAY_SEL_I_ADQ1_POS)
#define PSRAM_CTRL_REG_DELAY_SEL_I_ADQ1_UMSK                    (~(((1U<<PSRAM_CTRL_REG_DELAY_SEL_I_ADQ1_LEN)-1)<<PSRAM_CTRL_REG_DELAY_SEL_I_ADQ1_POS))
#define PSRAM_CTRL_REG_DELAY_SEL_I_ADQ0                         PSRAM_CTRL_REG_DELAY_SEL_I_ADQ0
#define PSRAM_CTRL_REG_DELAY_SEL_I_ADQ0_POS                     (8U)
#define PSRAM_CTRL_REG_DELAY_SEL_I_ADQ0_LEN                     (8U)
#define PSRAM_CTRL_REG_DELAY_SEL_I_ADQ0_MSK                     (((1U<<PSRAM_CTRL_REG_DELAY_SEL_I_ADQ0_LEN)-1)<<PSRAM_CTRL_REG_DELAY_SEL_I_ADQ0_POS)
#define PSRAM_CTRL_REG_DELAY_SEL_I_ADQ0_UMSK                    (~(((1U<<PSRAM_CTRL_REG_DELAY_SEL_I_ADQ0_LEN)-1)<<PSRAM_CTRL_REG_DELAY_SEL_I_ADQ0_POS))
#define PSRAM_CTRL_REG_DELAY_SEL_O_ADQ7                         PSRAM_CTRL_REG_DELAY_SEL_O_ADQ7
#define PSRAM_CTRL_REG_DELAY_SEL_O_ADQ7_POS                     (16U)
#define PSRAM_CTRL_REG_DELAY_SEL_O_ADQ7_LEN                     (8U)
#define PSRAM_CTRL_REG_DELAY_SEL_O_ADQ7_MSK                     (((1U<<PSRAM_CTRL_REG_DELAY_SEL_O_ADQ7_LEN)-1)<<PSRAM_CTRL_REG_DELAY_SEL_O_ADQ7_POS)
#define PSRAM_CTRL_REG_DELAY_SEL_O_ADQ7_UMSK                    (~(((1U<<PSRAM_CTRL_REG_DELAY_SEL_O_ADQ7_LEN)-1)<<PSRAM_CTRL_REG_DELAY_SEL_O_ADQ7_POS))
#define PSRAM_CTRL_REG_DELAY_SEL_O_ADQ6                         PSRAM_CTRL_REG_DELAY_SEL_O_ADQ6
#define PSRAM_CTRL_REG_DELAY_SEL_O_ADQ6_POS                     (24U)
#define PSRAM_CTRL_REG_DELAY_SEL_O_ADQ6_LEN                     (8U)
#define PSRAM_CTRL_REG_DELAY_SEL_O_ADQ6_MSK                     (((1U<<PSRAM_CTRL_REG_DELAY_SEL_O_ADQ6_LEN)-1)<<PSRAM_CTRL_REG_DELAY_SEL_O_ADQ6_POS)
#define PSRAM_CTRL_REG_DELAY_SEL_O_ADQ6_UMSK                    (~(((1U<<PSRAM_CTRL_REG_DELAY_SEL_O_ADQ6_LEN)-1)<<PSRAM_CTRL_REG_DELAY_SEL_O_ADQ6_POS))

/* 0x90 : psram_intf_delay_ctrl4 */
#define PSRAM_CTRL_PSRAM_INTF_DELAY_CTRL4_OFFSET                (0x90)
#define PSRAM_CTRL_REG_DELAY_SEL_I_ADQ5                         PSRAM_CTRL_REG_DELAY_SEL_I_ADQ5
#define PSRAM_CTRL_REG_DELAY_SEL_I_ADQ5_POS                     (0U)
#define PSRAM_CTRL_REG_DELAY_SEL_I_ADQ5_LEN                     (8U)
#define PSRAM_CTRL_REG_DELAY_SEL_I_ADQ5_MSK                     (((1U<<PSRAM_CTRL_REG_DELAY_SEL_I_ADQ5_LEN)-1)<<PSRAM_CTRL_REG_DELAY_SEL_I_ADQ5_POS)
#define PSRAM_CTRL_REG_DELAY_SEL_I_ADQ5_UMSK                    (~(((1U<<PSRAM_CTRL_REG_DELAY_SEL_I_ADQ5_LEN)-1)<<PSRAM_CTRL_REG_DELAY_SEL_I_ADQ5_POS))
#define PSRAM_CTRL_REG_DELAY_SEL_I_ADQ4                         PSRAM_CTRL_REG_DELAY_SEL_I_ADQ4
#define PSRAM_CTRL_REG_DELAY_SEL_I_ADQ4_POS                     (8U)
#define PSRAM_CTRL_REG_DELAY_SEL_I_ADQ4_LEN                     (8U)
#define PSRAM_CTRL_REG_DELAY_SEL_I_ADQ4_MSK                     (((1U<<PSRAM_CTRL_REG_DELAY_SEL_I_ADQ4_LEN)-1)<<PSRAM_CTRL_REG_DELAY_SEL_I_ADQ4_POS)
#define PSRAM_CTRL_REG_DELAY_SEL_I_ADQ4_UMSK                    (~(((1U<<PSRAM_CTRL_REG_DELAY_SEL_I_ADQ4_LEN)-1)<<PSRAM_CTRL_REG_DELAY_SEL_I_ADQ4_POS))
#define PSRAM_CTRL_REG_DELAY_SEL_I_ADQ3                         PSRAM_CTRL_REG_DELAY_SEL_I_ADQ3
#define PSRAM_CTRL_REG_DELAY_SEL_I_ADQ3_POS                     (16U)
#define PSRAM_CTRL_REG_DELAY_SEL_I_ADQ3_LEN                     (8U)
#define PSRAM_CTRL_REG_DELAY_SEL_I_ADQ3_MSK                     (((1U<<PSRAM_CTRL_REG_DELAY_SEL_I_ADQ3_LEN)-1)<<PSRAM_CTRL_REG_DELAY_SEL_I_ADQ3_POS)
#define PSRAM_CTRL_REG_DELAY_SEL_I_ADQ3_UMSK                    (~(((1U<<PSRAM_CTRL_REG_DELAY_SEL_I_ADQ3_LEN)-1)<<PSRAM_CTRL_REG_DELAY_SEL_I_ADQ3_POS))
#define PSRAM_CTRL_REG_DELAY_SEL_I_ADQ2                         PSRAM_CTRL_REG_DELAY_SEL_I_ADQ2
#define PSRAM_CTRL_REG_DELAY_SEL_I_ADQ2_POS                     (24U)
#define PSRAM_CTRL_REG_DELAY_SEL_I_ADQ2_LEN                     (8U)
#define PSRAM_CTRL_REG_DELAY_SEL_I_ADQ2_MSK                     (((1U<<PSRAM_CTRL_REG_DELAY_SEL_I_ADQ2_LEN)-1)<<PSRAM_CTRL_REG_DELAY_SEL_I_ADQ2_POS)
#define PSRAM_CTRL_REG_DELAY_SEL_I_ADQ2_UMSK                    (~(((1U<<PSRAM_CTRL_REG_DELAY_SEL_I_ADQ2_LEN)-1)<<PSRAM_CTRL_REG_DELAY_SEL_I_ADQ2_POS))

/* 0x94 : psram_intf_delay_ctrl5 */
#define PSRAM_CTRL_PSRAM_INTF_DELAY_CTRL5_OFFSET                (0x94)
#define PSRAM_CTRL_REG_DELAY_SEL_I_DQS                          PSRAM_CTRL_REG_DELAY_SEL_I_DQS
#define PSRAM_CTRL_REG_DELAY_SEL_I_DQS_POS                      (0U)
#define PSRAM_CTRL_REG_DELAY_SEL_I_DQS_LEN                      (16U)
#define PSRAM_CTRL_REG_DELAY_SEL_I_DQS_MSK                      (((1U<<PSRAM_CTRL_REG_DELAY_SEL_I_DQS_LEN)-1)<<PSRAM_CTRL_REG_DELAY_SEL_I_DQS_POS)
#define PSRAM_CTRL_REG_DELAY_SEL_I_DQS_UMSK                     (~(((1U<<PSRAM_CTRL_REG_DELAY_SEL_I_DQS_LEN)-1)<<PSRAM_CTRL_REG_DELAY_SEL_I_DQS_POS))
#define PSRAM_CTRL_REG_DELAY_SEL_I_ADQ7                         PSRAM_CTRL_REG_DELAY_SEL_I_ADQ7
#define PSRAM_CTRL_REG_DELAY_SEL_I_ADQ7_POS                     (16U)
#define PSRAM_CTRL_REG_DELAY_SEL_I_ADQ7_LEN                     (8U)
#define PSRAM_CTRL_REG_DELAY_SEL_I_ADQ7_MSK                     (((1U<<PSRAM_CTRL_REG_DELAY_SEL_I_ADQ7_LEN)-1)<<PSRAM_CTRL_REG_DELAY_SEL_I_ADQ7_POS)
#define PSRAM_CTRL_REG_DELAY_SEL_I_ADQ7_UMSK                    (~(((1U<<PSRAM_CTRL_REG_DELAY_SEL_I_ADQ7_LEN)-1)<<PSRAM_CTRL_REG_DELAY_SEL_I_ADQ7_POS))
#define PSRAM_CTRL_REG_DELAY_SEL_I_ADQ6                         PSRAM_CTRL_REG_DELAY_SEL_I_ADQ6
#define PSRAM_CTRL_REG_DELAY_SEL_I_ADQ6_POS                     (24U)
#define PSRAM_CTRL_REG_DELAY_SEL_I_ADQ6_LEN                     (8U)
#define PSRAM_CTRL_REG_DELAY_SEL_I_ADQ6_MSK                     (((1U<<PSRAM_CTRL_REG_DELAY_SEL_I_ADQ6_LEN)-1)<<PSRAM_CTRL_REG_DELAY_SEL_I_ADQ6_POS)
#define PSRAM_CTRL_REG_DELAY_SEL_I_ADQ6_UMSK                    (~(((1U<<PSRAM_CTRL_REG_DELAY_SEL_I_ADQ6_LEN)-1)<<PSRAM_CTRL_REG_DELAY_SEL_I_ADQ6_POS))

/* 0xC0 : psram_dbg_sel */
#define PSRAM_CTRL_PSRAM_DBG_SEL_OFFSET                         (0xC0)
#define PSRAM_CTRL_REG_PSRAM_DBG_EN                             PSRAM_CTRL_REG_PSRAM_DBG_EN
#define PSRAM_CTRL_REG_PSRAM_DBG_EN_POS                         (0U)
#define PSRAM_CTRL_REG_PSRAM_DBG_EN_LEN                         (1U)
#define PSRAM_CTRL_REG_PSRAM_DBG_EN_MSK                         (((1U<<PSRAM_CTRL_REG_PSRAM_DBG_EN_LEN)-1)<<PSRAM_CTRL_REG_PSRAM_DBG_EN_POS)
#define PSRAM_CTRL_REG_PSRAM_DBG_EN_UMSK                        (~(((1U<<PSRAM_CTRL_REG_PSRAM_DBG_EN_LEN)-1)<<PSRAM_CTRL_REG_PSRAM_DBG_EN_POS))
#define PSRAM_CTRL_REG_PSRAM_DBG_SEL                            PSRAM_CTRL_REG_PSRAM_DBG_SEL
#define PSRAM_CTRL_REG_PSRAM_DBG_SEL_POS                        (4U)
#define PSRAM_CTRL_REG_PSRAM_DBG_SEL_LEN                        (4U)
#define PSRAM_CTRL_REG_PSRAM_DBG_SEL_MSK                        (((1U<<PSRAM_CTRL_REG_PSRAM_DBG_SEL_LEN)-1)<<PSRAM_CTRL_REG_PSRAM_DBG_SEL_POS)
#define PSRAM_CTRL_REG_PSRAM_DBG_SEL_UMSK                       (~(((1U<<PSRAM_CTRL_REG_PSRAM_DBG_SEL_LEN)-1)<<PSRAM_CTRL_REG_PSRAM_DBG_SEL_POS))

/* 0xF0 : psram_dummy_reg */
#define PSRAM_CTRL_PSRAM_DUMMY_REG_OFFSET                       (0xF0)
#define PSRAM_CTRL_REG_PSRAM_DUMMY_REG                          PSRAM_CTRL_REG_PSRAM_DUMMY_REG
#define PSRAM_CTRL_REG_PSRAM_DUMMY_REG_POS                      (0U)
#define PSRAM_CTRL_REG_PSRAM_DUMMY_REG_LEN                      (32U)
#define PSRAM_CTRL_REG_PSRAM_DUMMY_REG_MSK                      (((1U<<PSRAM_CTRL_REG_PSRAM_DUMMY_REG_LEN)-1)<<PSRAM_CTRL_REG_PSRAM_DUMMY_REG_POS)
#define PSRAM_CTRL_REG_PSRAM_DUMMY_REG_UMSK                     (~(((1U<<PSRAM_CTRL_REG_PSRAM_DUMMY_REG_LEN)-1)<<PSRAM_CTRL_REG_PSRAM_DUMMY_REG_POS))


struct  psram_ctrl_reg {
    /* 0x0 : psram_configure */
    union {
        struct {
            uint32_t reg_vendor_sel                 :  2; /* [ 1: 0],        r/w,        0x2 */
            uint32_t reserved_2_3                   :  2; /* [ 3: 2],       rsvd,        0x0 */
            uint32_t reg_ap_mr                      :  3; /* [ 6: 4],        r/w,        0x0 */
            uint32_t reserved_7                     :  1; /* [    7],       rsvd,        0x0 */
            uint32_t reg_wb_reg_sel                 :  2; /* [ 9: 8],        r/w,        0x0 */
            uint32_t reserved_10_11                 :  2; /* [11:10],       rsvd,        0x0 */
            uint32_t reg_config_w_pusle             :  1; /* [   12],          w,        0x0 */
            uint32_t reg_config_r_pusle             :  1; /* [   13],          w,        0x0 */
            uint32_t sts_config_w_done              :  1; /* [   14],          r,        0x1 */
            uint32_t sts_config_r_done              :  1; /* [   15],          r,        0x1 */
            uint32_t reg_config_req                 :  1; /* [   16],        r/w,        0x0 */
            uint32_t reg_config_gnt                 :  1; /* [   17],          r,        0x0 */
            uint32_t reserved_18_31                 : 14; /* [31:18],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } psram_configure;

