bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/Peripherals/psram_ctrl_reg.h
    /* 0x4 : psram_manual_control */
    union {
        struct {
            uint32_t reg_wc_sw                      :  6; /* [ 5: 0],        r/w,        0x0 */
            uint32_t reserved_6_7                   :  2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t reg_wc_sw_en                   :  1; /* [    8],        r/w,        0x0 */
            uint32_t reg_state_hold_tick            :  1; /* [    9],        r/w,        0x0 */
            uint32_t reserved_10_11                 :  2; /* [11:10],       rsvd,        0x0 */
            uint32_t reg_force_ceb_low              :  1; /* [   12],        r/w,        0x0 */
            uint32_t reg_force_ceb_high             :  1; /* [   13],        r/w,        0x0 */
            uint32_t reg_psram_resetb               :  1; /* [   14],        r/w,        0x1 */
            uint32_t reg_2x1x_edge_ali              :  1; /* [   15],        r/w,        0x0 */
            uint32_t sts_config_read                : 16; /* [31:16],          r,        0x0 */
        }BF;
        uint32_t WORD;
    } psram_manual_control;

    /* 0x8 : fifo_thres_control */
    union {
        struct {
            uint32_t reg_mask_w_fifo_cnt            : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t reg_mask_r_fifo_rem            : 16; /* [31:16],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } fifo_thres_control;

    /* 0xC : psram_manual_control2 */
    union {
        struct {
            uint32_t reg_hold_cycle_sw              :  4; /* [ 3: 0],        r/w,        0x8 */
            uint32_t reg_hc_sw_en                   :  1; /* [    4],        r/w,        0x0 */
            uint32_t reserved_5_31                  : 27; /* [31: 5],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } psram_manual_control2;

    /* 0x10 : winbond_psram_configure */
    union {
        struct {
            uint32_t reg_wb_latency                 :  4; /* [ 3: 0],        r/w,        0x1 */
            uint32_t reg_wb_drive_st                :  2; /* [ 5: 4],        r/w,        0x0 */
            uint32_t reserved_6_7                   :  2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t reg_wb_burst_length            :  2; /* [ 9: 8],        r/w,        0x3 */
            uint32_t reserved_10_11                 :  2; /* [11:10],       rsvd,        0x0 */
            uint32_t reg_wb_fix_latency             :  1; /* [   12],        r/w,        0x1 */
            uint32_t reg_wb_dpd_dis                 :  1; /* [   13],        r/w,        0x1 */
            uint32_t reserved_14_15                 :  2; /* [15:14],       rsvd,        0x0 */
            uint32_t reg_wb_pasr                    :  3; /* [18:16],        r/w,        0x0 */
            uint32_t reserved_19                    :  1; /* [   19],       rsvd,        0x0 */
            uint32_t reg_wb_hybrid_slp              :  1; /* [   20],        r/w,        0x0 */
            uint32_t reserved_21_31                 : 11; /* [31:21],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } winbond_psram_configure;

    /* 0x14 : winbond_psram_status */
    union {
        struct {
            uint32_t sts_wb_latency                 :  4; /* [ 3: 0],          r,        0x1 */
            uint32_t sts_wb_drive_st                :  2; /* [ 5: 4],          r,        0x0 */
            uint32_t reserved_6_7                   :  2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t sts_wb_burst_length            :  2; /* [ 9: 8],          r,        0x3 */
            uint32_t reserved_10_11                 :  2; /* [11:10],       rsvd,        0x0 */
            uint32_t sts_wb_fix_latency             :  1; /* [   12],          r,        0x1 */
            uint32_t sts_wb_dpd_dis                 :  1; /* [   13],          r,        0x1 */
            uint32_t reserved_14_15                 :  2; /* [15:14],       rsvd,        0x0 */
            uint32_t sts_wb_pasr                    :  3; /* [18:16],          r,        0x0 */
            uint32_t reserved_19                    :  1; /* [   19],       rsvd,        0x0 */
            uint32_t sts_wb_hybrid_slp              :  1; /* [   20],          r,        0x0 */
            uint32_t reserved_21_31                 : 11; /* [31:21],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } winbond_psram_status;

    /* 0x18  reserved */
    uint8_t RESERVED0x18[8];

    /* 0x20 : apmemory_psram_configure */
    union {
        struct {
            uint32_t reg_ap_burst_length            :  2; /* [ 1: 0],        r/w,        0x1 */
            uint32_t reserved_2_3                   :  2; /* [ 3: 2],       rsvd,        0x0 */
            uint32_t reg_ap_burst_type              :  1; /* [    4],        r/w,        0x1 */
            uint32_t reg_ap_rbx                     :  1; /* [    5],        r/w,        0x0 */
            uint32_t reg_ap_rf                      :  1; /* [    6],        r/w,        0x0 */
            uint32_t reserved_7                     :  1; /* [    7],       rsvd,        0x0 */
            uint32_t reg_ap_pasr                    :  3; /* [10: 8],        r/w,        0x0 */
            uint32_t reserved_11                    :  1; /* [   11],       rsvd,        0x0 */
            uint32_t reg_ap_w_latency_code          :  3; /* [14:12],        r/w,        0x2 */
            uint32_t reserved_15                    :  1; /* [   15],       rsvd,        0x0 */
            uint32_t reg_ap_drive_st                :  2; /* [17:16],        r/w,        0x1 */
            uint32_t reserved_18_19                 :  2; /* [19:18],       rsvd,        0x0 */
            uint32_t reg_ap_r_latency_code          :  3; /* [22:20],        r/w,        0x2 */
            uint32_t reserved_23                    :  1; /* [   23],       rsvd,        0x0 */
            uint32_t reg_ap_r_latency_type          :  1; /* [   24],        r/w,        0x0 */
            uint32_t reg_ap_linear_dis              :  1; /* [   25],        r/w,        0x0 */
            uint32_t reserved_26_27                 :  2; /* [27:26],       rsvd,        0x0 */
            uint32_t reg_ap_glb_reset_pulse         :  1; /* [   28],          w,        0x0 */
            uint32_t reserved_29_31                 :  3; /* [31:29],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } apmemory_psram_configure;

    /* 0x24 : apmemory_psram_status */
    union {
        struct {
            uint32_t sts_ap_burst_length            :  2; /* [ 1: 0],          r,        0x1 */
            uint32_t reserved_2_3                   :  2; /* [ 3: 2],       rsvd,        0x0 */
            uint32_t sts_ap_burst_type              :  1; /* [    4],          r,        0x1 */
            uint32_t sts_ap_rbx                     :  1; /* [    5],          r,        0x0 */
            uint32_t sts_ap_rf                      :  1; /* [    6],          r,        0x0 */
            uint32_t reserved_7                     :  1; /* [    7],       rsvd,        0x0 */
            uint32_t sts_ap_pasr                    :  3; /* [10: 8],          r,        0x0 */
            uint32_t reserved_11                    :  1; /* [   11],       rsvd,        0x0 */
            uint32_t sts_ap_w_latency_code          :  3; /* [14:12],          r,        0x2 */
            uint32_t reserved_15                    :  1; /* [   15],       rsvd,        0x0 */
            uint32_t sts_ap_drive_st                :  2; /* [17:16],          r,        0x1 */
            uint32_t reserved_18_19                 :  2; /* [19:18],       rsvd,        0x0 */
            uint32_t sts_ap_r_latency_code          :  3; /* [22:20],          r,        0x2 */
            uint32_t reserved_23                    :  1; /* [   23],       rsvd,        0x0 */
            uint32_t sts_ap_r_latency_type          :  1; /* [   24],          r,        0x0 */
            uint32_t reserved_25_31                 :  7; /* [31:25],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } apmemory_psram_status;

    /* 0x28  reserved */
    uint8_t RESERVED0x28[88];

    /* 0x80 : psram_intf_delay_ctrl0 */
    union {
        struct {
            uint32_t reg_delay_sel_o_dqs_oen        :  8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t reg_delay_sel_o_ceb            :  8; /* [15: 8],        r/w,        0x0 */
            uint32_t reg_delay_sel_o_clk_n          :  8; /* [23:16],        r/w,        0x0 */
            uint32_t reg_delay_sel_o_clk            :  8; /* [31:24],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } psram_intf_delay_ctrl0;

    /* 0x84 : psram_intf_delay_ctrl1 */
    union {
        struct {
            uint32_t reg_delay_sel_o_adq1           :  8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t reg_delay_sel_o_adq0           :  8; /* [15: 8],        r/w,        0x0 */
            uint32_t reg_delay_sel_o_adq_oen        :  8; /* [23:16],        r/w,        0x0 */
            uint32_t reg_delay_sel_o_dqs            :  8; /* [31:24],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } psram_intf_delay_ctrl1;

    /* 0x88 : psram_intf_delay_ctrl2 */
    union {
        struct {
            uint32_t reg_delay_sel_o_adq5           :  8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t reg_delay_sel_o_adq4           :  8; /* [15: 8],        r/w,        0x0 */
            uint32_t reg_delay_sel_o_adq3           :  8; /* [23:16],        r/w,        0x0 */
            uint32_t reg_delay_sel_o_adq2           :  8; /* [31:24],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } psram_intf_delay_ctrl2;

