bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/Peripherals/psram_ctrl_reg.h
    /* 0x8C : psram_intf_delay_ctrl3 */
    union {
        struct {
            uint32_t reg_delay_sel_i_adq1           :  8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t reg_delay_sel_i_adq0           :  8; /* [15: 8],        r/w,        0x0 */
            uint32_t reg_delay_sel_o_adq7           :  8; /* [23:16],        r/w,        0x0 */
            uint32_t reg_delay_sel_o_adq6           :  8; /* [31:24],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } psram_intf_delay_ctrl3;

    /* 0x90 : psram_intf_delay_ctrl4 */
    union {
        struct {
            uint32_t reg_delay_sel_i_adq5           :  8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t reg_delay_sel_i_adq4           :  8; /* [15: 8],        r/w,        0x0 */
            uint32_t reg_delay_sel_i_adq3           :  8; /* [23:16],        r/w,        0x0 */
            uint32_t reg_delay_sel_i_adq2           :  8; /* [31:24],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } psram_intf_delay_ctrl4;

    /* 0x94 : psram_intf_delay_ctrl5 */
    union {
        struct {
            uint32_t reg_delay_sel_i_dqs            : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t reg_delay_sel_i_adq7           :  8; /* [23:16],        r/w,        0x0 */
            uint32_t reg_delay_sel_i_adq6           :  8; /* [31:24],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } psram_intf_delay_ctrl5;

    /* 0x98  reserved */
    uint8_t RESERVED0x98[40];

    /* 0xC0 : psram_dbg_sel */
    union {
        struct {
            uint32_t reg_psram_dbg_en               :  1; /* [    0],        r/w,        0x0 */
            uint32_t reserved_1_3                   :  3; /* [ 3: 1],       rsvd,        0x0 */
            uint32_t reg_psram_dbg_sel              :  4; /* [ 7: 4],        r/w,        0x0 */
            uint32_t reserved_8_31                  : 24; /* [31: 8],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } psram_dbg_sel;

    /* 0xc4  reserved */
    uint8_t RESERVED0xc4[44];

    /* 0xF0 : psram_dummy_reg */
    union {
        struct {
            uint32_t reg_psram_dummy_reg            : 32; /* [31: 0],        r/w, 0xffff0000 */
        }BF;
        uint32_t WORD;
    } psram_dummy_reg;

};

typedef volatile struct psram_ctrl_reg psram_ctrl_reg_t;


#endif  /* __PSRAM_CTRL_REG_H__ */
